{
	"skills": [
		"HTML",
		"CSS",
		"JavaScript",
		"TypeScript",
		"SASS",
		"React.js",
		"Next.js",
		"PWA",
		"Service Workers",
		"Web Workers",
		"Vite",
		"Jest/Vitest",
		"Redux",
		"React Query",
		"TailwindCSS",
		"HeadlessUI",
		"AntD",
		"Storybook",
		"Framer-Motion",
		"Three.js",
		"Git",
		"Styled Components"
	],
	"familiar": [
		"Node.js",
		"Python",
		"C#",
		"Asp.Net Core 7",
		"MongoDB",
		"Mongoose",
		"TypeORM",
		"GraphQL",
		"Express.js",
		"Nest.js",
		"Docker",
		"Bash",
		"CI/CD"
	],
	"experiences": [
		{
			"title": "EXBITO",
			"description":"Exbito is an online exchange and trading platform for cryptocurrencies, contributed to the success of the platform in an agile framework with a focus on enhancing user experience and technical efficiency. Managed and contributed to four main projects, including the trading web app, admin panel, landing website, and Strapi CMS for the landing website. Key achievements include the modernization of the web application by leading the migration from React-rewired and JavaScript to Vite and TypeScript, resulting in significantly improved code maintainability and overall performance. Additionally, implemented an innovative solution for sharing data between multiple tabs using Web Workers, enhancing real-time data synchronization and user experience. Played a pivotal role in boosting the landing site's performance, resulting in faster load times and improved user engagement. " ,
			"tools":[
				"HTML",
				"CSS",
				"TypeScript",
				"React.js",
				"Vite",
				"Next.js",
				"ISR",
				"TailwindCSS",
				"Ant Design",
				"Shared Worker",
				"Service Worker",
				"Axios",
				"React query",
				"Graphql",
				"Strapi",
				"Storybook"
			],
			"date":"April 2023 - present",
			"logo":"/images/exbito.svg" ,
			"website":"https://app.exbito.com",
			"github":null
		},
		{
			"title": "BANINO",
			"description":"This project was created with scalability, performance, and security in mind. The development of this project was a collaborative effort between multiple team members, who used Agile methodologies, HTML, CSS, TypeScript, React.js, Next.js, Recoil, SWR, and TailwindCSS to create detailed interactive interfaces that are responsive and accessible to all users. React.js was used to create efficient and reliable components, while Next.js was used for Server-Side Rendering, Incremental Static Rendering, and Code Splitting. Recoil was used to manage state and data on the client-side, and SWR was used to manage and cache data. TailwindCSS was used to create a consistent look and feel with custom styling, making the application enjoyable to use." ,
			"tools":[
				"HTML",
				"CSS",
				"TypeScript",
				"React.js",
				"Next.js",
				"SSR",
				"ISR",
				"Recoil",
				"SWR",
				"TailwindCSS",
				"HeadlessUI",
				"qs",
				"Lodash",
				"Axios",
				"Next pwa",
				"Bundle Analyzer"
			],
			"date":"August 2022 - April 2023",
			"logo":"/images/banino.svg" ,
			"website":"https://baninopc.com",
			"github":null
		},
		{
			"title": "ZOIE",
			"description":"The Zoie project is for a talented photographer, it was made with React.js, a powerful and popular JavaScript library, which was used to create the interactive user interface. Subsequently, Next.js was used to provide Server Side Rendering (SSR) and improve the performance of the application.\nCSS, SASS, TypeScript, TailwindCSS, and Styled Components were used to styling the components to match the client's preferences. Redux was employed to manage the application's state and to provide a smooth transition between pages. To create smooth and intuitive animations, Framer Motion was utilized. Finally, Node.js was used to deploy the application on the AWS server.\nThese technologies enabled us to create a beautifully designed platform that fits the client's needs." ,
			"tools":[
				"HTML",
				"CSS",
				"SASS",
				"TypeScript",
				"React.js",
				"Next.js",
				"SSR",
				"Redux",
				"Styled Components",
				"TailwindCSS",
				"Framer Motion",
				"Node.js"
			],
			"date":"October 2020 - Present",
			"logo":"/images/zoie.png" ,
			"website":"https://zoie.com",
			"github":"https://github.com/finishedcoot/zoie-next-typed"
		},
		{
			"title": "FAKHR E JAVID",
			"description":"Designed and developed a website for Fakhr e Javid, a local publication. The goal was to create a modern yet minimal website that is responsive and provides a great user experience. To do this, I used HTML, CSS, SASS, React.js, Gatsby.js, Static Site Generation, Styled Components and Framer Motion. The website was designed with ease-of-use in mind, and I optimized the performance to ensure a fast loading time and smooth scrolling. To provide the best user experience possible, I implemented animation with Framer Motion and made sure to keep the website aesthetically pleasing with Styled Components. In the end, I was able to deliver a website that was both beautiful and functional" ,
			"tools":[
				"HTML",
				"CSS",
				"SASS",
				"React.js",
				"Gatsby.js",
				"SSG",
				"Styled Components",
				"Framer Motion"
			],
			"date":"July 2021 - Present",
			"logo":"/images/fakhr-e-javid.png" ,
			"website":"https://fakhr-e-javid.com/",
			"github":"https://github.com/finishedcoot/fakhr-e-javid"
		},
		{
			"title": "SORMEI BEATZ",
			"description":"Created a modern and minimal design for the website of Sormei Beatz. React.js was used to build interactive elements and structures, providing a great user experience for the user. Gatsby.js was implemented for Static Site Generation, which ensures a smooth loading experience for the users. Styled Components were used to maintain a consistent style throughout the website, while Three.js was used to create an interactive 3D noise field to visualize different frequencies of the playing song. Finally, optimization was performed to ensure the website was as fast and efficient as possible" ,
			"tools":[
				"HTML",
				"CSS",
				"React.js",
				"Gatsby.js",
				"SSG",
				"Styled Components",
				"Three.js"
			],
			"date":"April 2022 - August 2022",
			"logo":"/images/sormei.png" ,
			"website":"https://sormeibeatz.netlify.app/",
			"github":"https://github.com/finishedcoot/sormeibeatz"
		}
	]
}


